In [85]:
import pandas as pd

# Series

In [86]:
data = [1, 2, 3, 4]

In [87]:
s = pd.Series(data)

In [88]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [89]:
index = ['Linha ' + str(i) for i in range (4)]

In [90]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3']

In [91]:
s = pd.Series(data = data, index = index)

In [92]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
dtype: int64

In [93]:
data = {'Linha ' + str(i) : i + 1 for i in range (5)}
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [94]:
s = pd.Series(data)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [95]:
s1 = s + 2
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [96]:
s2 = s + s1
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

## DataFrame

In [97]:
data=[
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [98]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [99]:
index = ['Linha ' + str(i) for i in range(3)]

In [100]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [101]:
df1 = pd.DataFrame(data = data, index = index)

In [102]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [103]:
columns = ['Coluna ' + str(i) for i in range(3)]

In [104]:
df1 = pd.DataFrame(data = data, index = index, columns=columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [105]:
data = {'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
        'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
        'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [106]:
df2 = pd.DataFrame(data = data)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [107]:
data=[
    (1, 2, 3),
    (4, 5, 6),
    (7, 8, 9)
]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [108]:
df3 = pd.DataFrame(data = data, index = index, columns=columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [109]:
df1[df1>0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [110]:
df2[df2>0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [111]:
df3[df3>0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [112]:
df4 = pd.concat([df1,df2,df3])
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [113]:
df4 = pd.concat([df1,df2,df3], axis=1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C